init.org
* Index links
** by keys
*** f1
(global-set-key (kbd "C-<f1> C-<f1>") (lambda () (interactive)
                (find-file-other-frame (expand-file-name "ORG/start.org" user-emacs-directory))))
(global-set-key (kbd "C-<f1> C-<f2>") (lambda () (interactive)
                (find-file-other-frame (expand-file-name "init.org" user-emacs-directory))))
*** <f2>
(define-key evil-insert-state-map (kbd "<f2>") '(lambda() (interactive)
                (save-buffer)
                (evil-normal-state)))
*** C-c
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
*** C-s
**** evil-insert-state-map
(define-key evil-insert-state-map (kbd "C-s") '(lambda() (interactive)
*** C-h
**** evil-insert-state-map
(define-key evil-insert-state-map (kbd "C-h") '(lambda() (interactive)
*** return
**** org-mode-map
(define-key org-mode-map
      (kbd "S-M-<return>") 'org-insert-subheading)
** mods
global-set-key
evil-normal-state-map
evil-visual-state-map
org-mode-map
org-src-mode-map
* **Core Initialization (Ядро)**
:PROPERTIES:
:header-args: :mkdirp yes
:END:
** описание
   Всё, что связано с базовой загрузкой, включая `init.el`, пакеты и первоначальные настройки.
   установка пкетменеджеров страйта и юз-пакеджера.
** TODO init.el 
:PROPERTIES:
:header-args: :tangle init.el
:END:
*** Start of manual file
**** load INI/init.el
;; --------------------------------------
;; .emacs --- Emacs configuration
;; --------------------------------------
;; * Start of manual file
;; --------------------------------------
;; (find-file-other-window "~/.archemacs/INI/init.el")
;; (load "~/.archemacs/INI/init.el")
#+begin_src elisp :tangle init.el
(load (expand-file-name "INI/init.el" user-emacs-directory))
#+end_src
**** load INI/init-light.el
;; (find-file-other-window "~/.archemacs/INI/init-light.el")
#+begin_src elisp :tangle no
;; (load (expand-file-name "INI/init-light.el" user-emacs-directory))
#+end_src
;; --------------------------------------
;; ** End of manual file
;; --------------------------------------
;; --------------------------------------
*** START OF AUTOMATION 
;; * START OF AUTOMATION 
;; --------------------------------------
 '(gptel-model "gpt-3.5-turbo-16k")
#+begin_src elisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(ediff-split-window-function 'split-window-horizontally)
 '(ediff-window-setup-function 'ediff-setup-windows-plain)
 '(package-selected-packages
   '(aider w3m emms ytel-show ytel lsp-treemacs lsp-ivy lsp-ui clj-refactor cider lsp-mode parinfer-rust-mode which-key diminish magit ranger yasnippet-snippets skewer-mode reverse-im rainbow-delimiters quelpa-use-package projectile powerline plantuml-mode outshine org-roam-ui org-brain ob-translate miracle material-theme lua-mode jedi ivy hydra hledger-mode graphviz-dot-mode gptel gpt flycheck expand-region evil-tabs elpy company-jedi company-fuzzy avy)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(mode-line ((t (:foreground "Black" :background "DarkOrange" :box nil)))))
#+end_src
 '(package-vc-selected-packages '((aider :url "https://github.com/tninja/aider.el"))))
*** TODO сменить "gpt-3.5-turbo-16k"
 '(gptel-model "gpt-3.5-turbo-16k")
** "INI/init.el"
:PROPERTIES:
:header-args: :tangle INI/init.el
:END:
*** els load list
#+begin_src elisp
(load (expand-file-name "INI/inpak.el" user-emacs-directory))

(load (expand-file-name "INI/vanila_cfg.el" user-emacs-directory))

(load (expand-file-name "INI/evil-mod-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/interface-mods.el" user-emacs-directory))

(load (expand-file-name "INI/org-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/file-mng-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/hydra-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/frame-control.el" user-emacs-directory))

(load (expand-file-name "INI/auto-cfg.el" user-emacs-directory))

;; (load (expand-file-name "INI/folding-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/lit-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/dev-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/FIN/fin.el" user-emacs-directory))

(use-package eww
  :defer t
  :config
  (load (expand-file-name "INI/www-cfg.el" user-emacs-directory)))

(load (expand-file-name "INI/advnsed-selections-cfg.el" user-emacs-directory))

(load (expand-file-name "INI/AI/ai.el" user-emacs-directory))

(load (expand-file-name "ELs/BuYn/shell.el" user-emacs-directory))

;; (load "~/Dropbox/backup/file.el")
(let ((file-path "~/Dropbox/backup/file.el"))
  (when (file-exists-p file-path)
    (load file-path)))

(let ((file-path
       (concat
        "~/.emacs.d/"
        (nth 0 (split-string
                (with-temp-buffer
                  (insert-file-contents "/etc/hostname")
                  (buffer-string))))
        ".el")))
  (when (file-exists-p file-path)
    (load file-path)))

(message "Load of init.el is ended")
#+end_src
** INI/inpak.el
:PROPERTIES:
:header-args: :tangle INI/inpak.el
:END:

;; (find-file "~/INI/init.el")
#+begin_src elisp
;; ** add package-archives
;; --------------------------------------
(require 'package)
;; add from melpa site;  {{{
(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                    (not (gnutls-available-p))))
       (proto (if no-ssl "http" "https")))
  (when no-ssl
    (warn "\
Your version of Emacs does not support SSL connections,
which is unsafe because it allows man-in-the-middle attacks.
There are two things you can do about this warning:
1. Install an Emacs version that does support SSL and be safe.
2. Remove this warning from your init file so you won't see it again."))
  ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired
  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
  (when (< emacs-major-version 24)
    ;; For important compatibility libraries like cl-lib
    (add-to-list 'package-archives (cons "gnu" (concat proto "://elpa.gnu.org/packages/")))))
; }}}
;; (add-to-list 'package-archives
;; ;;        '("melpa" . "http://melpa.org/packages/") t)
;;        '("melpa" . "http://melpa.org/packages/") )
;; (add-to-list 'package-archives 
;;     '("org" . "http://orgmode.org/elpa/") t)
(add-to-list 'package-archives 
     '("melpa-stable" . "http://stable.melpa.org/packages/") t)
;; --------------------------------------
;; ** Automatically Installing Packages
;; --------------------------------------
;; D:\Development\lisp\doc\Cfg\use-pac.txt
;; --------------------------------------
;; M-x package-refresh-contents
;; before
;; M-x package-install RET evil
;; if you're going to call (package-initialize) yourself.
;;(setq package-enable-at-startup nil)

(package-initialize)
(when (not package-archive-contents)
  (package-refresh-contents))

(defvar myPackages '(
  better-defaults
  use-package
    material-theme))

(mapc #'(lambda (package)
    (unless (package-installed-p package)
      (package-install package)))
      myPackages)
;; (require 'use-package)

;; tar not found when trying to install from melpa 
;; You probably have an outdated package database
;; (package-refresh-contents)
;; ;; This is only needed once, near the top of the file
;; (eval-when-compile
;;   ;; Following line is not needed if use-package.el is in ~/.emacs.d
;;   (add-to-list 'load-path "<path where use-package is installed>")
;;   (require 'use-package))
;; --------------------------------------
;; ** quelpa-use-package :
;; --------------------------------------
(require 'use-package) 
(use-package quelpa-use-package :ensure t)
;; --------------------------------------
#+end_src
** INI/vanila_cfg.el
:PROPERTIES:
:header-args: :tangle INI/vanila_cfg.el
:END:
*** used in
;; (find-file "~/INI/init.el")
[[*els load list][els load list]]
