init.org
* **UI и интерфейсные улучшения**
** описание
   Темы, powerline, minimap и кастомные элементы интерфейса.
** INI/interface-mods.el
:PROPERTIES:
:header-args: :tangle INI/interface-mods.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
*** src
#+begin_src elisp
;; * IVY CUSTOMIZATION
;; --------------------------------------
(require 'use-package)
(use-package ivy :ensure t
  ;; :init
  ;; (elpy-enable)
  :config
  (ivy-mode 1)
  (ido-mode nil)
  )
;;  --------------------------------------
;; * AVY CUSTOMIZATION
;; --------------------------------------
(use-package avy :ensure t
  ;; :init
  ;; (elpy-enable)
  :config
    (define-key evil-normal-state-map (kbd "M-f") 'avy-goto-word-1)
    (define-key evil-normal-state-map (kbd "M-F") 'avy-goto-char-timer)
    (define-key evil-normal-state-map (kbd "f") 'evil-avy-goto-char-in-line)
    (define-key evil-visual-state-map (kbd "f") 'evil-avy-goto-char-in-line)
    (define-key evil-normal-state-map (kbd "F") nil)
    (define-key evil-visual-state-map (kbd "F") nil)
    ;; (define-key evil-normal-state-map (kbd "FF") 'khaoos-evil-find-char)
    ;; (define-key evil-visual-state-map (kbd "FF") 'khaoos-evil-find-char)
    (define-key evil-normal-state-map (kbd "FF") 'evil-find-char)
    (define-key evil-visual-state-map (kbd "FF") 'evil-find-char)
    (define-key evil-normal-state-map (kbd "FJ") 'avy-goto-word-1-below)
    (define-key evil-visual-state-map (kbd "FJ") 'avy-goto-word-1-below)
    (define-key evil-normal-state-map (kbd "FK") 'avy-goto-word-1-above)
    (define-key evil-visual-state-map (kbd "FK") 'avy-goto-word-1-above)
    (define-key evil-normal-state-map (kbd "FH") 'avy-goto-char-timer)
    (define-key evil-visual-state-map (kbd "FH") 'avy-goto-char-timer)
    (define-key evil-normal-state-map (kbd "FL") 'avy-goto-char-timer)
    (define-key evil-visual-state-map (kbd "FL") 'avy-goto-char-timer)
    ;; (define-key evil-normal-state-map (kbd "Ff") 'khaoos-evil-find-char-backward)
    ;; (define-key evil-visual-state-map (kbd "Ff") 'khaoos-evil-find-char-backward)
    (define-key evil-normal-state-map (kbd "Ff") 'evil-find-char-backward)
    (define-key evil-visual-state-map (kbd "Ff") 'evil-find-char-backward)
  )
;; --------------------------------------
;; * DIMINISH CUSTOMIZATION
;; --------------------------------------
(use-package diminish
  :ensure t
  :demand t
  ;; :init
  :config
  (diminish 'which-key-mode)
  ;; (diminish 'linum-relative-mode)
  ;; (diminish 'hungry-delete-mode)
  ;; (diminish 'subword-mode)
  ;; (diminish 'beacon-mode)
  ;; (diminish 'irony-mode)
  ;; (diminish 'page-break-lines-mode)
  ;; (diminish 'auto-revert-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'rainbow-mode)
  (diminish 'org-roam-ui-mode)
  (diminish 'yas-minor-mode)
  ;; (diminish 'yas-minor-mode)
  ;; (diminish 'flycheck-mode)
  (diminish 'ivy-mode)
  (diminish 'outshine-mode)
  ;; (diminish 'outshine)
  ;; (diminish 'outline-mode)
  (diminish 'company-fuzzy-mode " CpF")
  (diminish 'outline-minor-mode)
  (diminish 'ComFuz-mode)
  ;; (diminish 'subword-mode)
  (diminish 'visual-line-mode)
  ;; (diminish '+3-mode)
  (diminish 'helm-mode))
;; --------------------------------------
;; * WHICH-KEY CUSTOMIZATION
;; --------------------------------------
(use-package which-key
  :ensure t
  :config
    (which-key-mode))
;; --------------------------------------

;;  --------------------------------------
;; * POWERLINE CUSTOMIZATION
;; --------------------------------------
;; (find-file-other-frame "~/.archemacs/INI/interface/powerline-cfg.el")
;; (load "~/.archemacs/INI/interface/powerline-cfg.el")
(load (expand-file-name "INI/interface/powerline-cfg.el" user-emacs-directory))
;; --------------------------------------
;; * INPUT-METHODS CUSTOMIZATION: 
;; --------------------------------------
;; (find-file-other-frame "~/.archemacs/INI/interface/input-methods-cfg.el")
;; (load "~/.archemacs/INI/interface/input-methods-cfg.el")
(load (expand-file-name "INI/interface/input-methods-cfg.el" user-emacs-directory))
;; --------------------------------------

#+end_src

** INI/interface/powerline-cfg.el
:PROPERTIES:
:header-args: :tangle INI/interface/powerline-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/interface-mods.el")
*** src
#+begin_src elisp
;; * POWERLINE CUSTOMIZATION
;; --------------------------------------
;; (find-file-other-frame "~/.archemacs/INI/interface/jonathanchu-emacs-powerline-cfg.el") 
;; (load "~/.archemacs/INI/interface/jonathanchu-emacs-powerline-cfg.el")
(load (expand-file-name "INI/interface/jonathanchu-emacs-powerline-cfg.el" user-emacs-directory))
;; --------------------------------------;; 
;; * SPACELINE CUSTOMIZATION
;; --------------------------------------;; 
;; (find-file-other-frame "~/.archemacs/INI/interface/spaceline-cfg.el") notuse
;; (load "~/.archemacs/INI/interface/spaceline-cfg.el")
;; (load (expand-file-name "INI/interface/spaceline-cfg.el" user-emacs-directory))
;; --------------------------------------;; 
#+end_src
** INI/interface/jonathanchu-emacs-powerline-cfg.el
:PROPERTIES:
:header-args: :tangle INI/interface/jonathanchu-emacs-powerline-cfg.el
:END:
*** описание
*** used in
;; (find-file "~/INI/interface/powerline-cfg.el")
*** src
#+begin_src elisp
;; * POWERLINE CUSTOMIZATION
;; --------------------------------------
;; ** install
;; https://github.com/Dewdrops/powerline
;; https://github.com/jonathanchu/emacs-powerline
(unless (package-installed-p 'powerline)
  (use-package powerline 
  ;; :ensure t 
    :quelpa ( powerline 
              ;; :repo "dewdrops/powerline"
              :repo "jonathanchu/emacs-powerline"
              :fetcher github)))
;; ** use-package powerline : 
;; *** --------------------------------------
(use-package powerline 
  ;; :ensure t
;; *** :init
  ;; :init 
  ;;  (set-face-attribute 'mode-line nil
  ;;                      :foreground "Black"
  ;;                      :background "DarkOrange"
  ;;                      :box nil)
  ;;  (setq powerline-arrow-shape 'curve);; 
;; *** :config : 
  :config
    ;; (load "~/ELs/powerline/sm-package-powerline.el")
    ;; (powerline-default-theme)
    (setq powerline-arrow-shape 'curve);; 
    (set-face-attribute 'mode-line nil
                        :foreground "Black"
                        :background "DarkOrange"
                        :box nil)
    (custom-set-faces
    '(mode-line ((t (
                      ;; :foreground "#030303"
                      ;; :background "#bdbdbd"
                      :foreground "Black"
                      :background "DarkOrange"
                      :box nil)))))
    ;; '(mode-line-inactive ((t (
    ;;                  :foreground "#f9f9f9"
    ;;                  :background "#666666"
    ;;                  :box nil)))))
;; *** END )
  )
;; --------------------------------------;; 

#+end_src
** CANCELED INI/interface/spaceline-cfg.el
CLOSED: [2025-02-11 Tue 16:29]
:PROPERTIES:
:header-args: :tangle no
:END:
# :tangle INI/interface/spaceline-cfg.el
*** описание
Не используется но следовола бы перейти
много потдержки и явлется основным решение
которое устанавливается с мельпы а не в ручную с гита
*** used in
;; (find-file "~/INI/interface/powerline-cfg.el")
*** src
#+begin_src elisp
;; * SPACELINE CUSTOMIZATION
;; ** spaceline powerline : 
(use-package spaceline 
  :ensure t
;; *** spaceline config
  :config
    ;; (spaceline-spacemacs-theme)
    ;; (spaceline-emacs-theme)
  (require 'spaceline-config)
    (setq spaceline-buffer-encoding-abbrev-p nil)
    (setq spaceline-line-column-p nil)
    (setq spaceline-line-p nil)
    (setq powerline-default-separator (quote arrow))
    (spaceline-spacemacs-theme)
;; *** END )
  )
;; --------------------------------------
#+end_src
** INI/interface/input-methods-cfg.el
:PROPERTIES:
:header-args: :tangle INI/interface/input-methods-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/interface-mods.el")
*** src
#+begin_src elisp
;; * REVERSE-IM CUSTOMIZATION:
;; --------------------------------------
;; ** install
;; https://github.com/a13/reverse-im.el
(use-package reverse-im
  :ensure t
;; ** :config:
  :custom
  (reverse-im-input-methods '("russian-computer"))
  :config
  (reverse-im-mode t)
;; ** define-key:
  ;; (define-key evil-visual-state-map (kbd "M-U") 'reverse-im-translate-region)
  (define-key evil-visual-state-map (kbd "M-U") '(lambda () (interactive) 
            (reverse-im-translate-region (region-beginning) (region-end))
            (toggle-input-method)))
  (define-key evil-insert-state-map (kbd "M-U") 'reverse-im-translate-word)
  (define-key evil-insert-state-map (kbd "C-U") '(lambda () (interactive) 
            (reverse-im-translate-word 1)
            (toggle-input-method)))
;; ** use-package END)
  )
;; ** --------------------------------------
#+end_src
* **горячие клавиши**
** **Evil и навигация**
*** evil-mod
:PROPERTIES:
:header-args: :tangle INI/evil-mod-cfg.el
:END:
**** описание
  Всё, связанное с `evil-mode`, табами и улучшением навигации по буферам/фреймам.  
**** used in
;; (find-file "~/.archemacs/INI/init.el")
