init.org
*** INI/fullscreen-cfg.el
:PROPERTIES:
:header-args: :tangle INI/fullscreen-cfg.el
:END:
**** описание
;; (find-file "~/.archemacs/INI/frame-control.el")
**** used in
;; (find-file "~/.archemacs/INI/init.el")
**** src
#+begin_src elisp
;; * FULLSCREEN-MOD CUSTOMIZATION
;; --------------------------------------
;; (setq-local fullscreen-mode-activ nil)
(defvar-local fullscreen-mode-activ nil
  "indictate is fullscreen mode is activ or not
    or if not init nil
    set it aftar init to false")
;; ** toggle-full-screen :
(defun toggle-full-screen ()
  "Toggles full-screen mode for Emacs window on Win32."
  (interactive)
  (toggle-frame-fullscreen)
)
;; --------------------------------------
;; ** toggle-fonte-lage-size : 
(defun toggle-fonte-lage-size ()
  "Toggle betwin fullscrin font size and normal"
  (interactive)
  ;; use a property “state”. Value is t or nil
  (if (get 'toggle-font-lage-size 'state)
      (progn
        (text-scale-set 0)
        (put 'toggle-font-lage-size 'state nil))
      (progn
        (text-scale-set +3)
        (put 'toggle-font-lage-size 'state t))))
;; --------------------------------------
;; ** toggle-bars : 
(defun toggle-bars ()
  "Toggles bars visibility."
  (interactive)
  (menu-bar-mode)
  (scroll-bar-mode))
;; --------------------------------------
;; ** toggle-full-screen-and-bars : 
(defun toggle-full-screen-and-bars ()
  "Toggles full-screen mode and bars."
  (interactive)
  ;; (toggle-bars)
  ;; (setq-local fullscreen-mode-activ (not fullscreen-mode-activ))
  ;; (toggle-full-screen)
  (toggle-frame-maximized)
  (toggle-fonte-lage-size)
  (toggle-fullscreen-minimap)
  ;; (evil-window-set-width 0)
  )
;; ** toggle-full-screen-and-minimap : 
(defun toggle-full-screen-and-minimap ()
  "Toggles full-screen mode and minimap."
  (interactive)
  ;; (toggle-bars)
  (setq-local fullscreen-mode-activ (not fullscreen-mode-activ))
  (toggle-frame-maximized)
  ;; (toggle-full-screen)
  (toggle-fonte-lage-size)
  (toggle-fullscreen-minimap)
  ;; (evil-window-set-width 0)
  )
;; ** toggle-fullscreen-minimap : 
;; --------------------------------------
(defun toggle-fullscreen-minimap ()
  "Toggle minimap in fullscreen
    fullscreen is chekt on fullscreen-mode-activ"
  (interactive)
  ;; (minimap-mode)
  ;; (minimap-create)
  (if fullscreen-mode-activ
    ;; (minimap-create-window)
    (minimap-mode)
    (minimap-kill))
  ;; (minimap-recenter)
  ;; (minimap-mode)
  ;; (minimap-update nil)
  ;; (minimap-update)
  ;; (minimap-active-current-buffer-p)
    )
;; ** toggle-fullscreen-agenda : 
(defun toggle-fullscreen-agenda ()
  "Full screen for agenda mode
    if all work rewrite for all mods"
  (interactive)
  (unless (boundp fullscreen-mode-activ)
    (defvar-local fullscreen-mode-activ nil
      "indictate is fullscreen mode is activ or not
        or if not init nil
        set it aftar init to false"))
  ;; (toggle-frame-fullscreen)
  (toggle-frame-maximized)
  (if fullscreen-mode-activ
        (text-scale-set 0)
        (text-scale-set +3))
  (setq-local fullscreen-mode-activ (not fullscreen-mode-activ)))
  
;; ** set-key : 
;; --------------------------------------
;; Use F11 to switch between windowed and full-screen modes
;;(global-set-key (kbd "C-M-f") 'toggle-full-screen-and-bars)
;;(define-key evil-normal-state-map [(control shift f)] 'toggle-full-screen-and-bars)
;; (global-set-key [(control shift f)]  'toggle-full-screen-and-bars)
(global-set-key [(control shift f)]  'toggle-fullscreen-agenda)
;; --------------------------------------
;; ** --------------------------------------
#+end_src

;; * MINIMAP-MODE CUSTOMIZATION 
;; --------------------------------------
;; (find-file-other-frame "~/.archemacs/INI/frames/minimap-cfg.el")
;; (load "~/.archemacs/INI/frames/minimap-cfg.el")
;; --------------------------------------
*** CANCELED INI/frames/minimap-cfg.el
CLOSED: [2025-02-21 Fri 21:34]
:PROPERTIES:
:header-args: :tangle no
:END:
# :header-args: :tangle INI/frames/minimap-cfg.el
**** описание

**** commeted in
;; (find-file-other-frame "~/INI/fullscreen-cfg.el")
**** src
#+begin_src elisp
;; * MINIMAP-MODE CUSTOMIZATION 
;; --------------------------------------
;; ** use-package minimap
(use-package minimap
              :ensure t
;; ** :config : 
  :config
  ;; (minimap-mode)
;; *** setq : 
  ;; (setq minimap-recreate-windo nil)
  ;; (setq minimap-major-modes nil)
  (setq minimap-width-fraction 0.1)
  (setq minimap-minimum-width 0.03)
  (setq minimap-highlight-line nil)
  (setq minimap-update-delay 0.3)
  (setq minimap-automatically-delete-window nil)
  (setq minimap-recreate-window nil)
  ;; (setq minimap-major-modes '(prog-mode, org-mode, help-mode))
  ;; (setq minimap-major-modes '(prog-mode))
  (setq minimap-major-modes '(eww-mode Info-mode))
  ;; (setq minimap-major-modes '(prog-mode org-mode Info-mode))
  ;; (setq minimap-major-modes '(prog-mode org-mode Info-mode eww-mode))
;; *** custom-set-faces : 
  (custom-set-faces
   '(minimap-active-region-background ((
                ((background dark))
                (:background "#454590" :extend t))
          (t (:background "#A84708FE0FFF" :extend t)))))
;; ** END of use-package minimap-mode
  )
;; ** Docs
;; After installation, simply use M-x minimap-mode to toggle activation of the minimap.
;; Use 'M-x customize-group RET minimap RET' to adapt minimap to your needs.
;; --------------------------------------
;; ** --------------------------------------
;; * SUBLIMITY-MODE CUSTOMIZATION
;; --------------------------------------
;; ** use-package 
;; (use-package sublimity
;;              :ensure t
;; ** :config : 
  ;; :config
  ;;  (sublimity-map-set-delay 1)
;; ** END of use-package minimap-mode
  ;; )
;; ** Docs
;; https://github.com/zk-phi/sublimity
;; (require 'sublimity)
;; (require 'sublimity-scroll)
;; (require 'sublimity-map) ;; experimental
;; (require 'sublimity-attractive)
;; then call command M-x sublimity-mode (or put the following expression in your init file).
;; (sublimity-mode 1)
;; (sublimity-mode 0)
;; (sublimity-map-set-delay 1)
;; (setq sublimity-map-size 20)
;; (setq sublimity-map-fraction 0.01)
;; (setq sublimity-map-text-scale -90)

;; --------------------------------------
;; ** --------------------------------------
#+end_src
** **Hydra и горячие клавиши**
*** описание
      Всё, что касается кастомных меню и команд.  
*** INI/hydra-cfg.el
:PROPERTIES:
:header-args: :tangle INI/hydra-cfg.el
:END:
**** описание
**** TODO разбить на несколько файлов
и загружать их из тела юз пака
фаили меинменю
фаил остальных меню
и загружать только после первого открытия меню
**** used in
;; (find-file "~/.archemacs/INI/init.el")
**** src
***** use-package hydra
;; * HYDRA CUSTOMIZATION
#+begin_src elisp
(use-package hydra :ensure t
  )
#+end_src
***** spc-main-menus
