INI/hydra-cfg.el

(defhydra spc-main-menu00 (:color blue)
;; ***** hint
    "
    ^Main^                00                ^Menus^          
    ^─────^───────────────────────────────────^─────^────────────
		_a_I			_d_ev menu    _o_rg-mode   _b_Org-Brain                       
    _w_ww             _y_nke-menu  _r_eader
		_c_ommands			_e_macs-menu   ya_s_nippet      
    _p_rev-menu   _q_uit   _SPC_ next  _n_ext-menu    
    "
;; ***** keys
    ("q" nil)
    ("o" org-menu/body)
    ("d" hydra-dev-menu/body)
    ("w" www-menu/body)
    ("e" hydra-emacs-menu/body)
    ("c" hydra-commands-menu/body)
    ("a" hydra-ai-menu/body)
    ("SPC" spc-main-menu01/body )
    ("y" hydra-yank-menu/body)
    ("n" spc-main-menu01/body)
    ("s" hydra-yasnippet/body )
    ("r" hydra-reader-menu/body )
    ("b" hydra-brain-org-menu/body)
    ("p" spc-main-menu99/body)
;; ***** END of def
  )

(setq pixel-wait 0)
(defhydra hydra-reader-menu (:color blue)
  ;; "Reader menu spd: % 'pixel-wait"
  "Reader menu "
  ;; "Reader menu spd: %(* 10 (- 1 pixel-wait))"
;; **** r : 
  ("r" (if (bound-and-true-p pixel-scroll-mode)
          (buyn-reader-end)
          (buyn-reader-start))
        "toggle reader")
;; **** f : 
  ("f" (setq pixel-wait (- pixel-wait 0.1))
          (format "faster spd:%s" (- 1 pixel-wait)) :color pink)
;; **** s : 
  ("s" (setq pixel-wait (+ pixel-wait 0.1)) "slower":color pink)
;; **** t : 
  ("t" red-aloud-this "aloudThis")
;; **** B : 
  ("B" read-aloud-buf "aloudBuffer")
;; **** s : 
  ("S" read-aloud-stop "StopAloud")
;; **** E : 
  ("E" read-aloud-change-engine "AloudEngine")
;; **** q : 
  ("q" nil "quit"))
;; --------------------------------------

(defhydra hydra-yasnippet ( :color pink
              ;; :hint nil
              )
;; **** Hint
  "
              ^YASnippets^
--------------------------------------------
  Modes:    Load/Visit:    Actions:

 _g_lobal  _d_irectory    _i_nsert
 _m_inor   _f_ile         _t_ryout
 _e_xtra   _l_ist         _n_ew
 _q_uit    _a_ll
"
;; **** Keys
  ("d" yas-load-directory)
  ("e" yas-activate-extra-mode)
  ("i" yas-insert-snippet :color blue)
  ("w" yas-wrap-around-region :color blue)
  ("f" yas-visit-snippet-file :color blue)
  ("n" yas-new-snippet :color blue)
  ("t" yas-tryout-snippet)
  ("l" yas-describe-tables :color blue)
  ("g" yas/global-mode)
  ("m" yas/minor-mode)
  ("a" yas-reload-all)
  ("q" nil "quit")
;; **** END )
  )

(fset 'mac-done-copy
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("dzadd`dpza``" 0 "%d")) arg)))

(defun curent-time-format-hh-mm (p-h p-m)
  "curent-time-format-hh-mm"
  (concat
    (number-to-string (+ p-h (nth 2 (decode-time))))
    ":"
    (let ((i (+ p-m (nth 1 (decode-time)))))
      (if (> i  9)
          (number-to-string i)
          (concat "0" (number-to-string i))))))

(defhydra hydra-ai-menu (:color blue)
    ("c" (hydra-ai-chat-menu/body) "AI chat")
    ("m" (hydra-ai-model-menu/body) "AI model")
    ("r" (hydra-ai-role-menu/body) "AI roles")
    ("d" (hydra-ai-docs-menu/body) "AI docs")
    ("q" nil) 
    )

(defhydra hydra-ai-model-menu (:color blue)
		;; (find-file-other-frame "~/Dropbox/backup/models/gemeni1-5.el")
    ("g" (load "~/Dropbox/backup/models/gemeni1-5.el") "Gemeni1.5")
		;; (find-file-other-frame "~/Dropbox/backup/models/claude.el")
    ("c" (load "~/Dropbox/backup/models/claude.el") "Claude")
		;; (find-file-other-frame "~/Dropbox/backup/models/openai.el")
    ("o" (load "~/Dropbox/backup/models/openai.el") "gpt-4o-mini")
		;; (find-file-other-frame "~/Dropbox/backup/models/mixtral.el")
    ("m" (load "~/Dropbox/backup/models/mixtral.el") "mixtral")
		;; (find-file-other-frame "~/Dropbox/backup/models/llama70v.el")
    ("l" (load "~/Dropbox/backup/models/llama70v.el") "llama70v")
    ("q" nil) 
    )

(defhydra hydra-ai-docs-menu (:color blue)
    ("c" (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/open-al-chat.org") "open-al-chat")
    ("m" (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/multiagent-ai.org") "multiagent-ai")
    ("a" (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/al-Audio-gen.org") "al-Audio-gen")
    ("s" (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/Stable_Diffusion.org") "Stable_Diffusion")
    ("S" (find-file-other-frame "~/Dropbox/Office/Games/Game-logs/AI/2024-06-07-SD-story.org") "SD-log")
    ("d" (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/worlds.org") "aiworlds")
    ("C" (find-file-other-frame "~/Dropbox/Office/Research/Doc/Codex/BuYn_Codex.org") "BuYn_Codex")
    ("q" nil) 
    )

(defhydra hydra-ai-role-menu (:color blue)
    ("e" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/acid-elisp.el") "elisp Acid")
    ("p" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/acid-python.el") "Py Acid")
    ("s" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/ai-synod.el")
            "Synode AI")
    ("l" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/leeloo-chat.el") "LeeLoo")
    ("t" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/ted-dan.el") "Ted DAN")
    ("h" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/ted-dan.el") "Ted holodeck")
    ("S" org-roam-menu/body "Sasha")
    ("g" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/glados-daen.el") "GLaDOS")
    ("d" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/catherine-tramell-daen.el") "DAEN Tramell")
    ("o" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/rpm-4options.el") "RPM 4option")
    ("m" (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/rpm-malu.el") "RPM MALU")
    ("q" nil) 
    )

(defhydra hydra-ai-chat-menu (:color blue)
    ("a" (progn
            (load "~/Dropbox/Office/Games/aidungeon/els/acid-chat.el")
            (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/chars-chat/2024-05-17-Acid_Burn.org")
            ) "Acid Burn")
    ("L" (progn
            (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/leeloo-chat.el")
            (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/chars-chat/2024-09-18-Leeloo.org")
            ) "LeeLoo")
    ("l" (progn
            (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/ai-synod.el")
            (find-file-other-frame "~/Dropbox/Office/Games/Game-logs/Tomb-of-Tyrants/2023-09-09-AI-story.org")
            ) "LogFile")
    ("t" (progn
            (load "/home/buyn/Dropbox/Office/Games/aidungeon/els/tpol-chat.el")
            (find-file-other-frame "~/Dropbox/Office/Games/aidungeon/chars-chat/2024-05-18-T-Pol.org"))
        "T'pol")
    ("q" nil) 
  )
