init.org
*** src
#+begin_src elisp
;; * FILE-MANAGEMENT-MODs CUSTOMIZATION
;; --------------------------------------
;; ** RANGER-MOD CUSTOMIZATION
(use-package ranger
  :ensure t
  :defer t
  ;; :config
  :bind (:map ranger-mode-map
              ("r r" . ranger-refresh)
              ("M-f" . avy-goto-word-1)
              ("g g" . ranger-goto-top)
              ("G G" . ranger-goto-bottom)
              ("Z F F" . find-file-other-frame)
              ("Z D D" . mkdir)
              ("Z F I" . (lambda() (interactive)
                           (find-file-other-frame
                            (expand-file-name
                             "INI/file-mng-cfg.el"
                             user-emacs-directory))))
              ))

;; --------------------------------------
;; ** DIRED-MOD CUSTOMIZATION
(use-package dired
 ;; :config
  )
;; --------------------------------------
;; * GITS-MODs CUSTOMIZATION
;; --------------------------------------
;; ** MAGIT-MOD CUSTOMIZATION
(use-package magit
  :ensure t
  :defer t
  :bind (:map magit-status-mode-map
              ("M-z M-z" . (lambda() (interactive)
                            (setq buyn-magit-buff-name (buffer-name))
                            (bury-buffer)))
              ("n n" . (lambda() (interactive)
                            (setq buyn-magit-buff-name (buffer-name))
                            (bury-buffer)))
              ("n f i" . (lambda() (interactive)
                           (find-file-other-frame
                            (expand-file-name
                             "INI/file-mng-cfg.el"
                             user-emacs-directory))))

              ("J J" . magit-display-repository-buffer)
              ("J j" . magit-status-jump)
              ("j" . magit-section-forward)

              ("K K" . magit-file-untrack)
              ("K k" . magit-discard)
              ("k" . magit-section-backward)

              ("p" . magit-push)

              ;; ("<F9> m m" .
              ("M-z M-m" .
               (lambda() (interactive)
                 (magit-git-command
                  "git checkout master;git merge experemental;git push;git checkout experemental")))
              ))
;; --------------------------------------
#+end_src
** ELs/BuYn/shell.el
:PROPERTIES:
:header-args: :tangle ELs/BuYn/shell.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
*** src
#+begin_src elisp
;; * BUYN's ELISP DEFUNS
;; --------------------------------------
;; ** varibls
;; (setq path-to-emagus-cmd "d:/Development/lisp/Emacs/bin/runemacs.exe") 
(setq path-to-emagus-cmd "D:/Development/lisp/Home/emacs_Run_home.cmd") 
(setq path-to-far "D://shell//FAR//Far.exe")
(setq path-to-emagus-client "d:/Development/lisp/Emacs/bin/emacsclientw.exe -n -c -a ''") 
(setq path-to-emagus-client-buyn "d:/Development/lisp/Emacs/bin/emacsclientw.exe -n -c -a 'buyn'") 
;; ** functions
;; *** buyn-shell-start :
(defun buyn-shell-start (cmd-params)
  " buyn start new process
    as parametr  
    get comand to execute
    "
  (shell-command
    (concat 
            cmd-params
            " &")))

;; *** buyn-cmd-start :
(defun buyn-cmd-start (cmd-params)
  " buyn start new cmd process
    as parametr  
    get comand to execute
    "
  (shell-command
    (concat "cmd"
            " /c "
            " start "
            cmd-params
            " &")))

;; *** buyn-cmd-start-syn :
(defun buyn-cmd-start-syn (cmd-params)
  " buyn start new cmd process
    as parametr  
    get comand to execute
    "
  (shell-command
    (concat "cmd"
            " /c "
            " start "
            cmd-params
            )
    )
  )

;; *** buyn-far :
(defun buyn-far (cmd-params)
  " buyn start new cmd process
    as parametr  
    get comand to execute
    "
  (buyn-cmd-start
    (concat path-to-far
            " "
            cmd-params
            ;; " &"
            )
    )
  )

;; *** buyn-start-emagus :
(defun buyn-start-emagus (unix-path-to-file)
  " buyn start new emacs process
    as parametr  
    get file path in unix format
    unix-path-to-file path to file in unix format
    "
  (shell-command
    (concat path-to-emagus-cmd
            " "
            unix-path-to-file
            " &"
            )
    )
  )

;; *** buyn-start-emagus-win : 
(defun buyn-start-emagus-win (win-path-to-file)
   "  buyn start new emacs process
    as parametr  
    get file path in Windos format
    win-path-to-file path to file in unix format
    "
    ;; (message (replace-regexp-in-string "/" (regexp-quote "\\") win-path-to-file t t))
(buyn-start-emagus
  ;; (message 
 (replace-regexp-in-string "\\\\" "/" win-path-to-file t t)
 )
    ;; (message (replace-regexp-in-string "\\\\" "/" win-path-to-file t t ))
;; (replace-regexp-in-string "/" "\\" path t t)
    ;; (replace-string "f" win-path-to-file)
    ;; (message win-path-to-file)
    )

;; * BUYN's ELISP DEFUNS
;; --------------------------------------
;; ** send-region-to-eshell-buffer-and-execute:
(defun send-region-to-eshell-buffer-and-execute(start end );&optional INTERCT
  " Make the custom function interactive and operative on a region
    prepend to the buffer named *eshell*
    switches to the buffer
    and execute-kbd-macro for enter C-m
    switches back to start buffe
    "
  (interactive "r") 
  (let ((buffer-name-to-back (buffer-name)))
      (prepend-to-buffer (get-buffer "*eshell*") start end)
      (switch-to-buffer-other-frame (get-buffer "*eshell*"))
      ;; (evil-insert-state)
      (execute-kbd-macro "\C-m")
      (switch-to-buffer-other-frame buffer-name-to-back)))
;; ** send-activ-line-to-eshell-buffer-and-execute:
(defun send-activ-line-to-eshell-buffer-and-execute()
  " Make the custom function interactive
    evaluet send-region-to-eshell-buffer-and-execute
    with region as from start to end line "
  (interactive) 
  (call-interactively
    (send-region-to-eshell-buffer-and-execute (line-beginning-position) (line-beginning-position 2))))

#+end_src
* **Литературное и текстовые задачи**
** описание
   Чтение текстов, работа с переводами, tts, `read-aloud`.  
** INI/lit-cfg.el
:PROPERTIES:
:header-args: :tangle INI/lit-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
*** src
#+begin_src elisp
;; * LITERARY-MOD CUSTOMIZATION 
;; --------------------------------------
;; ** LOAD TRANSLATE-MOD CUSTOMIZATION 
;; (find-file "~/.archemacs/INI/translate-cfg.el")
;; (find-file-other-frame "~/.archemacs/INI/translate-cfg.el") 
;; (load "~/.archemacs/INI/translate-cfg.el")
(load (expand-file-name "INI/translate-cfg.el" user-emacs-directory))
;; --------------------------------------
;; ** LOAD GRAMMER-MOD CUSTOMIZATION 
;; (find-file-other-frame "~/.archemacs/INI/lit-cfg/grammer-cfg.el") 
;; (load "~/.archemacs/INI/lit-cfg/grammer-cfg.el")
(load (expand-file-name "INI/lit-cfg/grammer-cfg.el" user-emacs-directory))
;; ** LOAD READ-ALOUD-MOD CUSTOMIZATION 
;; (find-file-other-frame "~/.archemacs/INI/lit-cfg/read-aloud-cfg.el") 
;; (load "~/.archemacs/INI/lit-cfg/read-aloud-cfg.el")
(load (expand-file-name "INI/lit-cfg/read-aloud-cfg.el" user-emacs-directory))
;; --------------------------------------
;; ** LOAD READERS MODS CUSTOMIZATION 
;; (find-file-other-frame "~/.archemacs/INI/lit-cfg/reader-cfg.el")
;; (load "~/.archemacs/INI/lit-cfg/reader-cfg.el")
(load (expand-file-name "INI/lit-cfg/reader-cfg.el" user-emacs-directory))
;; --------------------------------------
;; * LOAD BUYN's ELISP DEFUNS
;; (find-file-other-frame "~/.archemacs/ELs/BuYn/reader.el")
;; (load "~/.archemacs/ELs/BuYn/reader.el")
(load (expand-file-name "ELs/BuYn/reader.el" user-emacs-directory))
;; --------------------------------------

#+end_src
** INI/advnsed-selections-cfg.el
:PROPERTIES:
:header-args: :tangle INI/advnsed-selections-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
