INI/lit-cfg.el
;; * LITERARY-MOD CUSTOMIZATION 
;; --------------------------------------
;; ** LOAD TRANSLATE-MOD CUSTOMIZATION 
;; (find-file "~/.archemacs/INI/translate-cfg.el")
;; (find-file-other-frame "~/.archemacs/INI/translate-cfg.el") 
;; (load "~/.archemacs/INI/translate-cfg.el")
(load (expand-file-name "INI/translate-cfg.el" user-emacs-directory))
;; --------------------------------------
;; ** LOAD GRAMMER-MOD CUSTOMIZATION 
;; (find-file-other-frame "~/.archemacs/INI/lit-cfg/grammer-cfg.el") 
;; (load "~/.archemacs/INI/lit-cfg/grammer-cfg.el")
(load (expand-file-name "INI/lit-cfg/grammer-cfg.el" user-emacs-directory))
;; ** LOAD READ-ALOUD-MOD CUSTOMIZATION 
;; (find-file-other-frame "~/.archemacs/INI/lit-cfg/read-aloud-cfg.el") 
;; (load "~/.archemacs/INI/lit-cfg/read-aloud-cfg.el")
(load (expand-file-name "INI/lit-cfg/read-aloud-cfg.el" user-emacs-directory))
;; --------------------------------------
;; ** LOAD READERS MODS CUSTOMIZATION 
;; (find-file-other-frame "~/.archemacs/INI/lit-cfg/reader-cfg.el")
;; (load "~/.archemacs/INI/lit-cfg/reader-cfg.el")
(load (expand-file-name "INI/lit-cfg/reader-cfg.el" user-emacs-directory))
;; --------------------------------------
;; * LOAD BUYN's ELISP DEFUNS
;; (find-file-other-frame "~/.archemacs/ELs/BuYn/reader.el")
;; (load "~/.archemacs/ELs/BuYn/reader.el")
(load (expand-file-name "ELs/BuYn/reader.el" user-emacs-directory))
;; --------------------------------------
