init.org
*** src
#+begin_src elisp
;; * ADVNSED SELECTIONS CUSTOMIZATION
;; --------------------------------------
;; * expand-region cfg
;; ** use-package expand-region 
(use-package expand-region :ensure t
;; ** expand-region config
  :config
;; *** hydra-expand-region
;; **** defhydra
  (defhydra hydra-expand-region
  ;; (:color blue)
  (:body-pre 'er/expand-region)
  "expand-region"
;; ****  key list
  ("C-=" er/expand-region "more")
  ("=" er/expand-region "more")
  ("m" er/expand-region "more")
  ("SPC" er/expand-region "more")
  ("-" er/contract-region "less")
  ("l" er/contract-region "less")
  ("S-SPC" er/contract-region "less")
  ("C--" er/contract-region "less")
  ("w" er/mark-word "wrd")
  ("s" er/mark-symbol "smbl")
  ;; ("=" er/mark-symbol-with-prefix "more")
  ;; ("=" er/mark-next-accessor "more")
  ("f" er/mark-method-call "methd")
  ("'" er/mark-inside-quotes "iq")
  ("\"" er/mark-outside-quotes "oq")
  ("(" er/mark-inside-pairs "i(")
  (")" er/mark-outside-pairs "o)")
  (";" er/mark-comment ";")
  ("u" er/mark-url "url")
  ;; ("=" er/mark-email "more")
  ("d" er/mark-defun "def")
;; ****  END )
  )
;; **** Bind
(global-set-key (kbd "C-=") 'hydra-expand-region/body)
(define-key evil-visual-state-map (kbd "SPC") 'hydra-expand-region/body)
(define-key evil-normal-state-map "zv" 'hydra-expand-region/body)
;; *** binds
;; (global-set-key (kbd "C-=") 'er/expand-region)
;; ** END of use-package outshine 
  )
;; ** -------------------------------------- }}}


;; * evil-mc cfg
;; ** use-package evil-mc 
(use-package evil-mc :ensure t
;; ** evil-mc config
  :disabled
  :config
  (global-evil-mc-mode  1) ;; enable
  (define-key evil-visual-state-map "zi" 'evil-mc-make-cursor-in-visual-selection-end)
   ;; (define-key evil-visual-state-map "zj" 'evil-mc-make-cursor-move-next-line)
   ;; (define-key evil-visual-state-map "zk" 'evil-mc-make-cursor-move-prev-line)
   ;; (define-key evil-visual-state-map "zn" 'evil-mc-skip-and-goto-next-match)
   ;; (define-key evil-visual-state-map "zp" 'evil-mc-skip-and-goto-prev-match)
   ;; (define-key evil-visual-state-map "zN" 'evil-mc-skip-and-goto-next-cursor)
   ;; (define-key evil-visual-state-map "zP" 'evil-mc-skip-and-goto-prev-cursor)
   (define-key evil-visual-state-map "zo" 'evil-mc-make-all-cursors)
   (define-key evil-visual-state-map "zI" 'evil-mc-make-cursor-in-visual-selection-beg)
   (define-key evil-visual-state-map "zq" 'evil-mc-undo-all-cursors)
;; ** END of use-package outshine 
  )
;; ** -------------------------------------- 


#+end_src
** INI/translate-cfg.el
:PROPERTIES:
:header-args: :tangle INI/translate-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/lit-cfg.el")
;; (find-file-other-frame "~/INI/lit-cfg.el") 
*** src
#+begin_src elisp
;; * TRANSLATE-MOD CUSTOMIZATION 
;; *** ob-translate
;; **** use-package ob-translate 
(use-package popup :ensure t)
(use-package ob-translate :ensure t
  ;; (package-refresh-contents)
  ;; :init
  :config
  (add-to-list 'org-babel-load-languages '(translate . t))
  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
  ;; add translate special block into structure template alist.
  ;; (add-to-list 'org-structure-template-alist '("t" . "src translate"))
  ;; (add-to-list 'org-structure-template-alist '("tr" . "src translate :dest ru"))
  (add-to-list 'org-structure-template-alist '("t" "#+BEGIN_SRC translate ? \n\n#+END_SRC\n"))
  (add-to-list 'org-structure-template-alist '("tr" "#+BEGIN_SRC translate :dest ru ? \n\n#+END_SRC\n"))
  )
;; **** --------------------------------------
;; *** google-translate
;; **** use-package google-translate
(use-package google-translate
  :ensure t
  :custom
  (google-translate-backend-method 'emacs)
  :config
  (require 'google-translate-smooth-ui)
  (setq google-translate-translation-directions-alist
        '(("ru" . "en") ("en" . "ru") ("ru" . "uk")))
  (setq google-translate-output-destination nil)
  (setq google-translate-pop-up-buffer-set-focus t)
  (setq google-translate-default-source-language "ru")
  (setq google-translate-default-target-language "en")
  ;; (global-set-key "\C-ct" 'google-translate-smooth-translate)
  (define-key evil-normal-state-map (kbd "M-a M-l M-o") 'google-translate-smooth-translate)
  (define-key evil-normal-state-map (kbd "M-a M-l M-l") 'google-translate-at-point)
  (define-key evil-normal-state-map (kbd "M-a M-l M-j") 'google-translate-at-point)
  (define-key evil-normal-state-map (kbd "M-a M-l M-k") 'google-translate-at-point-reverse)
  (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130)))
;; **** --------------------------------------
;; *** go-translate
;; **** use-package go-translate
(use-package go-translate :ensure t
  ;; :init
  :disabled
  :config
  (setq go-translate-local-language "ru")
  (setq go-translate-target-language "en")
  (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130))
  )
;; **** --------------------------------------
#+end_src
** INI/lit-cfg/grammer-cfg.el
:PROPERTIES:
:header-args: :tangle INI/lit-cfg/grammer-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/lit-cfg.el")
;; (find-file-other-frame "~/INI/lit-cfg.el") 
*** src
#+begin_src elisp
;; * GRAMMER-MOD CUSTOMIZATION 
;; *** ispell
;; (setq ispell-program-name "~/AddApps/hunspell-1.3.2-3-w32-bin/bin/hunspell.exe")   
;; **** use-package  
(use-package ispell   
  :config   
  ;; :init
    ;; (setq ispell-program-name "~/AddApps/hunspell-1.3.2-3-w32-bin/bin/hunspell.exe")   
    ;; (setq ispell-program-name "D:/Development/lisp/HOME/AddApps/hunspell-1.3.2-3-w32-bin/bin/hunspell.exe")   
  )
#+end_src
*** Docs
**** exempls
;; (use-package ispell   
;;  :config   
;;    (setq ispell-program-name "C:/Program Files (x86)/hunspell-1.3.2-3-w32-bin/bin/hunspell.exe")   
;;    (setq ispell-local-dictionary "en_US")    
;;    (setq ispell-local-dictionary-alist       
;;      '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))
;;  )

**** Commands
;; (ispell)  to run check
;; (ispell-change-dictionary) to RU
** INI/lit-cfg/read-aloud-cfg.el
:PROPERTIES:
:header-args: :tangle INI/lit-cfg/read-aloud-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/lit-cfg.el")
;; (find-file-other-frame "~/INI/lit-cfg.el") 
