init.org
*** src
#+begin_src elisp
;; * READ-ALOUD-MOD CUSTOMIZATION 
;; *** load
;; (find-file-other-frame "~/INI/lit-cfg/read-aloud-cfg.el") 
;; (load "~/ELs/text-to-speech/read-aloud/read-aloud.el")
;; *** use-package read-aloud : 
;; (add-to-list 'load-path "~/ELs/text-to-speech/read-aloud")
(use-package read-aloud
  :defer t
  :load-path "ELs/text-to-speech/read-aloud"
  ;; :ensure t
;; *** :config : 
  :config
;; **** plist read-aloud-engines : 
;; ***** ru : 
;; ****** elena : 
(lax-plist-put read-aloud-engines "bal.ru.elena"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Elena" "-i" "-enc" "utf8")))
;; ****** Alyona22k : 
(lax-plist-put read-aloud-engines "bal.ru.Alyona22k"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Alyona22k" "-i" "-enc" "utf8")))
;; ****** anna : 
(lax-plist-put read-aloud-engines "bal.ru.anna"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "RHVoice Anna" "-i" "-enc" "utf8")))
;; ****** Irina : 
(lax-plist-put read-aloud-engines "bal.ru.Irina"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Irina" "-i" "-enc" "utf8")))
;; ****** Katerina : 
(lax-plist-put read-aloud-engines "bal.ru.Katerina"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Katerina" "-i" "-enc" "utf8")))
;; ****** Tatyana : 
(lax-plist-put read-aloud-engines "bal.ru.Tatyana"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Tatyana" "-i" "-enc" "utf8")))
;; ****** Milena : 
(lax-plist-put read-aloud-engines "bal.ru.Milena"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Milena" "-i" "-enc" "utf8")))
;; ***** ua : 
;; ******  Natalia : 
(lax-plist-put read-aloud-engines "bal.ua.Natalia"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Natalia" "-i" "-enc" "utf8")))
;; ***** en : 
;; ****** Slt : 
(lax-plist-put read-aloud-engines "bal.en.Slt"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Slt" "-i" "-enc" "utf8")))
;; ****** Bdl : 
(lax-plist-put read-aloud-engines "bal.en.Bdl"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Bdl" "-i" "-enc" "utf8")))
;; ****** Clb : 
(lax-plist-put read-aloud-engines "bal.en.Clb"
  '(cmd "~/AddApps/balcon/balcon.exe"
    args ( "-n" "Clb" "-i" "-enc" "utf8")))

;; ****** Heather
  (lax-plist-put read-aloud-engines "bal.en.Heather"
    '(cmd "~/AddApps/balcon/balcon.exe"
      args ( "-n" "Heather" "-i" "-enc" "utf8")))
;; ****** Lucy
(lax-plist-put read-aloud-engines "bal.en.Lucy"
  '(cmd "~/AddApps/balcon/balcon.exe"
      args ( "-n" "Lucy" "-i" "-enc" "utf8")))
;; ****** Jane22k
(lax-plist-put read-aloud-engines "bal.en.Jane"
  '(cmd "~/AddApps/balcon/balcon.exe"
      args ( "-n" "Jane" "-i" "-enc" "utf8")))
;; ****** jampal.en : 
  (lax-plist-put read-aloud-engines "jampal.en"
    '(cmd "cscript"
          args ("D:\\Development\\lisp\\Home\\AddApps\\Jampal\\ptts.vbs" "-r" "1")))
;; **** setq read-aloud-engine : 
;; (setq read-aloud-engine "jampal.en"))
;; (setq read-aloud-engine "balcon.ru")
;; (setq read-aloud-engine "bal.en.Slt")
  (setq read-aloud-engine "bal.en.Lucy")
;; *** ===========END========= ) : 
  )
;; ** Docs
;; *** Usage 
;; M-x read-aloud-this -- pronounce either the selection or a word under the pointer.
;; M-x read-aloud-buf -- read the buffer starting from the current cursor position, highlighting the text as it moves down the buffer. Useful only for plain text files.
;; top reading at any time you either run any of the commands above again, or do M-x read-aloud-stop.
;; M-x read-aloud-change-engine -- select another engine (for this Emacs session). It also shows which one is the current.
#+end_src
** INI/lit-cfg/reader-cfg.el
:PROPERTIES:
:header-args: :tangle INI/lit-cfg/reader-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/lit-cfg.el")
;; (find-file-other-frame "~/INI/lit-cfg.el") 
*** src
#+begin_src elisp
;; * READERS MODS CUSTOMIZATION 
;; ** fb2-mode
;; *** load
;; (add-to-list 'load-path "~/ELs/Readers/fb2-mode/")
;; (add-to-list 'load-path (expand-file-name "ELs/Readers/fb2-mode/" user-emacs-directory))
;; https://github.com/spline1986/fb2-mode
;; https://github.com/spline1986/fb2-mode.git
;; *** use-package fb2-mode : 
(use-package fb2-mode
  ;; :defer t
  ;; :ensure t
  ;; :disabled
  ;; :load-path "~/ELs/Readers/fb2-mode"
  :load-path "ELs/Readers/fb2-mode/"
  ;; :init
  ;; :load-path (expand-file-name "ELs/Readers/fb2-mode/" user-emacs-directory)
;; (find-file (expand-file-name "ELs/Readers/fb2-mode" user-emacs-directory))

;; *** :config : 
  :config
(add-to-list 'auto-mode-alist '("\\.fb2\\'" . fb2-mode))
(add-to-list 'auto-mode-alist '("\\.fb\\'" . fb2-mode))

;; (define-key fb2-mode-map (kbd "<f9>") 'read-aloud-stop)
;; (define-key fb2-mode-map (kbd "SPC") 'buyn-reader-go)
;; (define-key fb2-mode-map (kbd "S-SPC") 'evil-scroll-up)

;; (add-hook 'fb2-mode-hook #'toggle-word-wrap)
;; *** auto-mode-alist:
  ;; :mode (("\\.fb2\\'" "\\.fb\\'" ) . fb2-mode)
  ;; :mode ("\\.fb2\\'" "\\.fb\\'")
  ;; :mode
  ;; ("\\.fb2\\'" . fb2-mode)
  ;; :interpreter "fb2-mode"

;; *** ===========END========= ) : 
  )
;; *** Docs
 ;; https://github.com/spline1986/fb2-mode
 ;; Screenshot
 ;; Installation
 ;; fb2-show-images — if not nil then images in book will displayed (default t).
 ;; fb2-images-height — height of images in fb2-mode buffer (default 500).
 ;; fb2-replace-hard-spaces — if not nil then non-breaking spaces will replaced by spaces (default nil).
;; ** nov.el
;; *** use-package esxml-query : 
;; (use-package esxml-query
  ;; :defer t
  ;; :ensure t
  ;; :disabled
;; )

;; *** use-package nov.el : 
(use-package nov
  :defer t
  ;; :ensure t
  ;; :disabled
  ;; :load-path "~/ELs/Readers/nov.el/"
  :load-path "ELs/Readers/nov.el/"
  ;; :init
;; *** :config : 
  :config
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
  ;; :mode ("\\.epub\\'" . nov-mode)
;; *** ===========END========= ):
  )
;; *** Docs
;; git clone https://depp.brause.cc/nov.el.git
;; all doc in start mods
#+end_src
** ELs/BuYn/reader.el
:PROPERTIES:
:header-args: :tangle ELs/BuYn/reader.el
:END:
*** описание

*** used in
;; (find-file-other-frame "~/INI/lit-cfg.el")
