init.org
*** src
#+begin_src elisp
;; * AUTO-COMPLETE  CUSTOMIZATION
;; ** old vanila setings
;; --------------------------------------
;; (setq tab-always-indent 'complete)
;; (add-to-list 'completion-styles 'initials t)
;; --------------------------------------
;; ** company
(use-package company :ensure t
  :defer t
  :config
    (add-hook 'prog-mode-hook 'company-mode)
    ;; (setq completion-styles "basic substring emacs22")
    (setq completion-styles '(partial-completion substring emacs22))
    (define-key evil-insert-state-map (kbd "C-SPC") 'company-complete)
    (setq company-minimum-prefix-length 10)
    (setq company-require-match nil)
    (setq company-idle-delay nil)
    (setq company-show-numbers t)
  ;; :bind ("C-c c" hydra-clock/body)
;; ***  END use-package 
  )
;; (require 'company)
;; (require 'company)
;; ** defun program-mode-hook-customize : 
(defun program-mode-hook-customize (args)
  "comands fun list to customizing
  programing mode
  но есть подозрение что негде оно не запускается
  у сомпани свои настройуи
  у фузикомпани свои
  в каждый новерное нужно домавить эту
  и вообщегде есть програминг мод
  "
  (interactive "P")
    (display-line-numbers-mode t)
    (company-fuzzy-mode 1)
    (setq company-minimum-prefix-length 3)
    (setq company-show-numbers t)
    (setq company-idle-delay 0.1)
    (setq outshine-mode 1))
;; ** company fuze search
;; *** use-package company-fuzzy : 
(use-package company-fuzzy :ensure t
;; *** --------------------------------------
  ;; :defer 2
;; *** :init : 
 :diminish 
 :init
  (setq company-require-match nil)            ; Don't require match, so you can still move your cursor as expected.
  (setq company-tooltip-align-annotations t)  ; Align annotation to the right side.
  (setq company-eclim-auto-save nil)          ; Stop eclim auto save.
  (setq company-dabbrev-downcase nil)         ; No downcase when completion.
;; *** :config : 
  :config
  ;; Enable downcase only when completing the completion.
  (defun jcs--company-complete-selection--advice-around (fn)
    "Advice execute around `company-complete-selection' command."
    (let ((company-dabbrev-downcase t))
      (call-interactively fn)))
  (advice-add 'company-complete-selection :around #'jcs--company-complete-selection--advice-around)
;; *** add-hook 'prog-mode-hook : 
  (add-hook 'prog-mode-hook (lambda () 
    (setq company-show-numbers t)
    (setq company-fuzzy-mode 1)
    (setq company-minimum-prefix-length 3)
    (setq company-idle-delay 0.1)))
;; ***  END use-package 
  )
;; (require 'company)
;; (company-fuzzy-mode 1)
;; *** --------------------------------------
;; ** jedi 
;; --------------------------------------
(use-package jedi 
  :ensure t
  ;; :init
  ;; :disabled
  ;; (elpy-enable)
  :config
  ; move quick-help tooltips to the minibuffer
  (setq jedi:tooltip-method nil)

  ; don't auto-complete unless requested
  (setq ac-auto-start nil)
  (setq ac-auto-show-menu nil)
  ;; (define-key ac-mode-map (kbd "M-TAB") 'auto-complete)
  (add-hook 'python-mode-hook 'jedi:setup)
  (setq jedi:complete-on-dot t)  
  )

;; --------------------------------------
;; ** company-jedi 
;; --------------------------------------
(use-package company-jedi 
  :ensure t
  ;; :init
  ;; (elpy-enable)
  :config
  (defun my/python-mode-hook ()
    (add-to-list 'company-backends 'company-jedi))
  (add-hook 'python-mode-hook 'my/python-mode-hook)
  ;; (define-key evil-insert-state-map (kbd "m-SPC") 'company-jedi)
  )
;; --------------------------------------

#+end_src
** INI/auto/snippets-cfg.el
:PROPERTIES:
:header-args: :tangle INI/auto/snippets-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
*** src
#+begin_src elisp
;; * SNIPPETS  CUSTOMIZATION
;; ** yasnippet 
;; *** del: 
;; (unless (package-installed-p 'yasnippet)
;;   (package-install 'yasnippet))
;; только если устанавливать в ручную
;; (add-to-list 'load-path
;;               "~/.emacs.d/plugins/yasnippet")

;; *** use-package:
(use-package yasnippet
  :defer t
  ;; :ensure t
  ;; :disabled
  ;; :init
;; *** :config : 
  :config
  (use-package yasnippet-snippets
    :defer t)

  ;; (yas/initialize)
  (add-to-list 'ac-sources 'ac-source-yasnippet)
  (yas-global-mode 1)
;; *** ===========END========= ) : 
  )
;; ** yasnippet-snippets 
;; (unless (package-installed-p 'yasnippet-snippets)
;;   (package-install 'yasnippet-snippets))
;; (require 'yasnippet-snippets)

;; (unless (package-installed-p 'emacs-snippets)
;;   (package-install 'emacs-snippets))
;; (add-to-list 'load-path "~/path/to/yasnippet")
;; ;; Load the library
;; (require 'yasnippet)
;; (yas/initialize)
;; ;; Load the snippet files themselves
;; (yas/load-directory "~/path/to/yasnippet/snippets/text-mode")
;; ** Let's have snippets in the auto-complete dropdown
;; (add-to-list 'ac-sources 'ac-source-yasnippet)
;; --------------------------------------
#+end_src
** INI/AI/ai.el
:PROPERTIES:
:header-args: :tangle INI/AI/ai.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
*** src
#+begin_src elisp
(use-package gpt
  :disabled
  :ensure t
  :config
    ;; (setq gpt-openai-key "sk-*")
    ;; (setq gpt-openai-engine "gpt-3.5-turbo")
    (setq gpt-openai-engine "gpt-4o-mini")
    ;; (setq gpt-openai-engine "gpt-4o")
    ;; (setq gpt-openai-engine "gpt-4o-mini-2024-07-18")
    (define-key evil-normal-state-map (kbd "M-a M-j M-o") 'gpt-dwim)
  )

(use-package gptel
  ;; :disabled
  :ensure t
  :config
    ;; (custom-set-variables '(gptel-model "gpt-3.5-turbo-16k"))
    ;; (custom-set-variables '(gptel-model "gpt-4o"))
    ;; (custom-set-variables '(gptel-model "gpt-4o-mini-2024-07-18"))
    ;; (setq gptel-model "gpt-4o-mini-2024-07-18")
    (define-key evil-normal-state-map (kbd "M-a M-j M-S-h") 'gptel-system-prompt)
    (define-key evil-normal-state-map (kbd "M-a M-j M-j") 'gptel-send)
    (define-key evil-normal-state-map (kbd "M-a M-j M-h") 'gptel-mode)
    ;; (setq gpt-openai-key "sk-*")
    (setq gptel-default-mode 'org-mode)
    (custom-set-variables '(gptel-model "gpt-4o-mini"))
)

(custom-set-variables '(gptel-model "gpt-4o-mini"))
#+end_src
* **Программирование и языковые конфигурации**
** описание
   Отдельные категории для Python, Clojure, JavaScript, Lua и т.д. + автодополнения и проверки синтаксиса.  
** INI/dev-cfg.el
:PROPERTIES:
:header-args: :tangle INI/dev-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
