init.org
*** src
#+begin_src elisp

;; * DELIMITERS-MOD CUSTOMIZATION
;; --------------------------------------
;; ** rainbow-delimiters
;; *** install
;; M-x package-install RET rainbow-delimiters RET
(require 'use-package)
(use-package rainbow-delimiters :ensure t
;; *** :config
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
  (custom-theme-set-faces
    'material
    `(rainbow-delimiters-depth-1-face ((t
        (:foreground ,"aquamarine"))))
    )
;; *** END )
  )
;; *** Docs 
;; **** links:
;; https://github.com/Fanael/rainbow-delimiters
;; http://emacs-fu.blogspot.com/2011/05/toward-balanced-and-colorful-delimiters.html
;; **** Customization:
;; To customize rainbow-delimiters mode, you can use:

;; M-x customize-group rainbow-delimiters
;; (customize-group "rainbow-delimiters")
;; Color Scheme

;; customize-group rainbow-delimiters-faces has the faces for successive nested pairs of delimiters. You can change them through emacs customize or in your color theme or dot-emacs.

;; The face rainbow-delimiters-unmatched-face is used for unmatched closing delimiters.

;; Zenburn and Solarized themes have their own colors for these faces.

;; deftheme/color-theme.el: Further information is at the top of rainbow-delimiters.el.
;; Stop Highlighting Certain Delimiters

;; You can disable highlighting of any of the supported delimiter types through the customize interface, in the Toggle Delimiters section.
;; ** parinfer
;; *** install
(use-package parinfer
  :disabled
  :defer t
  :ensure t
  :bind
  (("C-," . parinfer-toggle-mode))
  :init
  (progn
    (setq parinfer-extensions
          '(defaults       ; should be included.
            pretty-parens  ; different paren styles for different modes.
            evil           ; If you use Evil.
            lispy          ; If you use Lispy. With this extension, you should install Lispy and do not enable lispy-mode directly.
            paredit        ; Introduce some paredit commands.
            smart-tab      ; C-b & C-f jump positions and smart shift with tab & S-tab.
            smart-yank))   ; Yank behavior depend on mode.
    (add-hook 'clojure-mode-hook #'parinfer-mode)
    (add-hook 'emacs-lisp-mode-hook #'parinfer-mode)
    (add-hook 'common-lisp-mode-hook #'parinfer-mode)
    (add-hook 'scheme-mode-hook #'parinfer-mode)
    (add-hook 'lisp-mode-hook #'parinfer-mode))
;; *** END )
  )
;; ** parinfer-rust-mode
;; *** install
(use-package parinfer-rust-mode
  ;; :disabled
  :defer t
  :ensure t
  ;; :hook emacs-lisp-mode
  ;; :init
    ;; (setq parinfer-rust-auto-download t)
  :config
    (setq  parinfer-rust-disable-troublesome-modes t)
    ;; (parinfer-rust-mode -1)
    (add-hook 'clojure-mode-hook #'parinfer-rust-mode)
    ;; (add-hook 'emacs-lisp-mode-hook #'parinfer-rust-mode)
    ;; (add-hook 'common-lisp-mode-hook #'parinfer-rust-mode)
    ;; (add-hook 'scheme-mode-hook #'parinfer-rust-mode)
    ;; (add-hook 'lisp-mode-hook #'parinfer-rust-mode)
;; *** END )
  )
#+end_src
** INI/dev/python-cfg.el
:PROPERTIES:
:header-args: :tangle INI/dev/python-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
*** src
#+begin_src elisp
;; * PYTHON-MOD CUSTOMIZATION
;; --------------------------------------
;; ** (use-package elpy
(require 'use-package)
(use-package elpy :ensure t
;; *** init : 
  :defer t
  :init
  (elpy-enable)
;; *** config : 
  :config
  ;; (elpy-enable)
  ;; (ivy-mode 1)
  (company-mode 1)
  ;; (setq compilation-scroll-output nil)
  (setq compilation-scroll-output t)
  ;; not working from config onli from init and not from hooks
  ;; (add-hook 'python-mode-hook 'elpy-mode)
  ;; (add-hook 'python-mode-hook 'elpy-enable)
  ;; (setq python-shell-interpreter "python"
  ;; python-shell-interpreter-args "-i")
  ;; findout what it do
  (add-to-list 'auto-mode-alist '("\\.kv$" . python-mode))
  ;; (add-to-list 'interpreter-mode-alist '("kv" . python-mode))
;; *** define-key : 
  (define-key evil-insert-state-map (kbd "C-SPC") 'company-complete)
  (define-key evil-normal-state-map (kbd "M-e M-f M-p") 'xref-find-definitions)
  (define-key evil-normal-state-map (kbd "M-e M-f M-P") 'xref-find-definitions-other-frame)
  (define-key evil-normal-state-map (kbd "M-e M-f M-o") 'elpy-occur-definitions)
  (define-key evil-normal-state-map (kbd "M-e M-f M-a") 'elpy-goto-assignment)
  (define-key evil-normal-state-map (kbd "M-e M-f M-d") 'elpy-goto-definition)
  (define-key evil-normal-state-map (kbd "M-e M-f M-D") 'elpy-goto-definition-other-window)
  ;; (define-key evil-insert-state-map (kbd "<f8>") '(lambda() (interactive)
  ;;      (org-save-all-org-buffers)
  ;;      (save-some-buffers 'no-confirm)
  ;;      (evil-normal-state)
  ;;      (recompile)
  ;;      ))
;; ***  ) : 
  )
#+end_src
** INI/dev/lua-cfg.el
:PROPERTIES:
:header-args: :tangle INI/dev/lua-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
*** src
#+begin_src elisp
;; * LUA-MOD CUSTOMIZATION
;; --------------------------------------
;; ** install lua-mode : 
(require 'use-package)
(use-package lua-mode 
  :ensure t
  :init
  ;; (elpy-enable)
;; ** :config : 
  :config
;; ** command : 
  ;; 2. Next, you need to make sure that lua-mode.el is on your load-path (and optionally byte-compile it) and to set up Emacs to automatically enable it for *.lua files or ones that contain lua hash-bang line (`#!/usr/bin/lua`). Putting this snippet to .emacs should be enough in most cases:
    ;;;; This snippet enables lua-mode
    ;; This line is not necessary, if lua-mode.el is already on your load-path
    ;; (add-to-list 'load-path "/path/to/directory/where/lua-mode-el/resides")
;; ** autoload : 
    (autoload 'lua-mode "lua-mode" "Lua editing mode." t)
    (add-to-list 'auto-mode-alist '("\\.lua$" . lua-mode))
    (add-to-list 'interpreter-mode-alist '("lua" . lua-mode))
;; ** ) : 
  )
;; --------------------------------------
#+end_src
** INI/dev/outshine_cfg.el
:PROPERTIES:
:header-args: :tangle INI/dev/outshine_cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/folding-cfg.el")
