init.org
*** src
#+begin_src elisp
;; * OUTSHINE-MOD CUSTOMIZATION 
;; --------------------------------------
;; ** use-package outshine
(use-package outshine :ensure t
  ;; uncoment to instal
  ;; loding each time - resrch how to setup right
  ;; :quelpa (outshine :fetcher github :repo "alphapapa/outshine")
;; ** outshine config
  :config
;; *** binds
  ;; (defvar outline-minor-mode-prefix "\M-#")
  (define-key evil-normal-state-map "zf" 'outshine-insert-heading)
;; **** zF
  (define-key evil-normal-state-map "zF" '(lambda() (interactive)
      ;; (evil-previous-line)
      (outshine-insert-comment-subtree )
      (insert (read-string "comment : "))
      ))

;; **** visual add zf
  (define-key evil-visual-state-map "zf" '(lambda() (interactive)
      (setq region-text (buffer-substring (region-beginning) (region-end)))
      (evil-normal-state)
      ;; (evil-open-above 1)
      (evil-previous-line)
      (outshine-insert-heading)
      ;; (backward-char)
      (save-excursion
        ;; (insert " ")
        (insert region-text)
        (unless (eq major-mode 'org-mode)
          (insert ":")
          )
      )))

;; *** outshine startup state
  (setq outshine-startup-folded-p 1)
;; *** autoload
  ;; (add-hook 'outline-minor-mode-hook 'outshine-hook-function)
  (add-hook 'outline-minor-mode-hook 'outshine-mode)
  (add-hook 'prog-mode-hook '(lambda () (outshine-mode t)))
  ;; (add-hook 'prog-mode-hook '(lambda () (outline-minor-mode t)))
  ;; (add-hook 'prog-mode-hook '(lambda () (setq outline-minor-mode 1)))
  ;; (add-hook 'emacs-lisp-mode-hook 'outline-minor-mode)
  ;; (add-hook 'python-mode-hook 'outline-minor-mode)
  ;; (add-hook 'lua-mode-hook 'outline-minor-mode)
  ;; (add-hook 'LaTeX-mode-hook 'outline-minor-mode)
;; *** theme customization
  ;; (custom-theme-set-faces
  ;; 'material
  ;; `(outline-1 ((t (:height 1.25 :weight bold))))
  ;; `(outline-2 ((t (:height 1.15 :weight bold))))
  ;; `(outline-3 ((t (:height 1.05 :weight bold))))
  ;; `(outline-4 ((t (:height 1.95 :weight bold))))
  ;; `(outline-5 ((t (:height 1.85 :weight bold))))
  ;; `(outline-6 ((t (:height 1.75 :weight bold))))
  ;; `(outline-7 ((t (:height 1.65 :weight bold))))

   ;; `(org-level-1 ((,class (:inherit outline-1
   ;;                       :background ,header-color
   ;;                       :weight bold
   ;;                       :box (:style released-button)
   ;;                       :height 1.3))))
   ;; `(org-level-2 ((,class (:inherit outline-2
   ;;                                :background ,"#35575b"
   ;;                                :box (:style released-button)
   ;;                       :height 1.2))))
   ;; `(org-level-3 ((,class (:inherit outline-3 :height 1.1))))
   ;; `(org-level-4 ((,class (:inherit outline-4 :height 1.0))))
   ;; `(org-level-5 ((,class (:inherit outline-5 ))))
   ;; `(org-level-6 ((,class (:inherit outline-6 ))))
   ;; `(org-level-7 ((,class (:inherit outline-7 ))))
   ;; `(org-level-8 ((,class (:inherit outline-8 ))))
   ;; `(org-level-9 ((,class (:inherit outline-9 ))))

;; ** END of use-package outshine 
  )
;; -------------------------------------- }}}
#+end_src
** CANCELED INI/dev/autohotkey-cfg.el
CLOSED: [2025-02-24 Mon 23:15]
:PROPERTIES:
:header-args: :tangle no
:END:
# :header-args: :tangle INI/dev/autohotkey-cfg.el
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
;; (load (expand-file-name "INI/dev/autohotkey-cfg.el" user-emacs-directory))

*** src
#+begin_src elisp
;; * AHK-MODE CUSTOMIZATION
;; --------------------------------------
;; ** install ahk-mode : 
(use-package ahk-mode
  :ensure t
;; ** :config : 
  :config
;; ** autoload : 
    ;; (autoload 'ahk-mode "ahk-mode" "Lua editing mode." t)
    (add-to-list 'auto-mode-alist '("\\.ahk$" . ahk-mode))
    (add-to-list 'interpreter-mode-alist '("ahk" . ahk-mode))
;; **   ) : 
  )

#+end_src
** CANCELED INI/dev/csharp-cfg.el
CLOSED: [2025-02-24 Mon 23:24]
:PROPERTIES:
:header-args: :tangle no
:END:
# :header-args: :tangle INI/dev/csharp-cfg.el
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
;; (load (expand-file-name "INI/dev/csharp-cfg.el" user-emacs-directory))

*** src
да он был пуст сам в шоке
#+begin_src elisp
;; * C#-MOD CUSTOMIZATION
;; --------------------------------------
#+end_src
** INI/dev/clojure-cfg.el
:PROPERTIES:
:header-args: :tangle INI/dev/clojure-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
(load (expand-file-name "INI/dev/clojure-cfg.el" user-emacs-directory))
*** src
#+begin_src elisp
;; * CLOJURE-MODE CUSTOMIZATION
;; --------------------------------------
;; ** clojure-mode
(use-package clojure-mode
  :defer t
  ;; :disabled
  :ensure t
  :config
 (setq clojure-indent-style 'align-arguments)
 (setq clojure-indent-keyword-style 'align-arguments)
  )
;; ** ob-clojur-mode
(use-package ob-clojure
  ;; :disabled
  :defer t
  ;; :ensure t
  :config
    (setq org-babel-clojure-backend 'cider)
  ;; (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
  ;; (custom-theme-set-faces
  ;;  'material
  ;;  `(rainbow-delimiters-depth-1-face ((t
  ;;      (:foreground ,"aquamarine"))))
  ;;  )
  )
;; ** use-package cider:
(use-package cider
  :defer t
  :ensure t
  :after clojure-mode
  :config
  ;; (set-lookup-handlers! 'cider-mode nil) ; doom option 
  ;; (setq lsp-enable-completion-at-point nil) ; use cider completion
  (setq cider-eldoc-display-for-symbol-at-point nil) ; disable cider showing eldoc during symbol at point
  )

;; ** clj-refactor
(use-package clj-refactor
  :defer t
  :ensure t
  :after clojure-mode
  :config
  ;; (set-lookup-handlers! 'clj-refactor-mode nil) ; doom option 
  (setq cljr-add-ns-to-blank-clj-files nil) ; disable clj-refactor adding ns to blank files
  )
;; ** Leiningen

;; ** --------------------------------------
;; * LSP-MODE CUSTOMIZATION
;; --------------------------------------
;; ** use-package lsp-mode:
(use-package lsp-mode
  :defer t
  :ensure t
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook
  (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
    (clojure-mode-hook . lsp)
    (clojurescript-mode-hook . lsp)
    (clojurec-mode-hook . lsp)
    ;; (XXX-mode . lsp)
    ;; if you want which-key integration
    (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp
  :config
  (setq gc-cons-threshold (* 100 1024 1024)
        read-process-output-max (* 1024 1024)
        treemacs-space-between-root-nodes nil
        company-minimum-prefix-length 1)
  )

;; ** use-package lsp-ui:
(use-package lsp-ui
  :defer t
  :ensure t
  :commands lsp-ui-mode)
;; ;; if you are helm user
;; (use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
;; ** use-package lsp-ivy:
(use-package lsp-ivy
  :defer t
  :ensure t
  :commands lsp-ivy-workspace-symbol)
;; ** lsp-treemacs:
(use-package lsp-treemacs
  :disabled
  :defer t
  :ensure t
  :commands lsp-treemacs-errors-list)

;; ** --------------------------------------
;; * use-package dap-mode:
;; optionally if you want to use debugger
;; (use-package dap-mode)


;; (use-package dap-LANGUAGE) to load the dap adapter for your language
;; ** --------------------------------------
#+end_src
** CANCELED INI/dev/unity-cfg.el
CLOSED: [2025-02-25 Tue 00:16]
:PROPERTIES:
:header-args: :tangle no
:END:
# :header-args: :tangle INI/dev/unity-cfg.el
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
(load (expand-file-name "INI/dev/unity-cfg.el" user-emacs-directory))

*** src
#+begin_src elisp
;; * UNITY CUSTOMIZATION
;; --------------------------------------
;; ** install miracle: Arcadia 
;; :quelpa (outshine :fetcher github :repo "alphapapa/outshine")
;; git clone https://github.com/Saikyun/miracle.git
(unless (package-installed-p 'miracle)
  (use-package miracle 
  ;; :ensure t 
    :quelpa (miracle :fetcher github :repo "Saikyun/miracle")))
  ;; (quelpa
  ;; '(miracle
  ;;  :fetcher github
  ;;  :url "https://github.com/saikyun/miracle.git"))
;; (quelpa '(miracle :repo "saikyun/miracle" :fetcher github))
;; (require 'use-package)
;; ** use-package miracle : 
(use-package miracle 
  ;; :ensure t
;; ** END )
  )
;; ** Docs 
;; *** links:
;; https://github.com/Saikyun/miracle
;; *** keys:
;; Keys   Description
;; C-c C-c  Evaluate expression at point.
;; C-c C-r  Evaluate region.
;; C-c C-k  Evaluate current buffer contents.
;; C-c C-l  Load current file from disk.
;; C-c C-d  Describe symbol at point, showing documentation in REPL window.
;; C-c C-n  Evaluate namespace.
;; C-c C-b  Interrupt running job.
;; M-.  Jump to definition of var at point.
;; M-,  Jump back to where you were before you did M-.
;; Miracle shortcuts for REPL buffer
;; Keys   Description
;; C-c C-d  Describe symbol at point, showing documentation in REPL window.
;; C-c C-c  Interrupt running job.
;; M-.  Jump to definition of var at point.
;; C-c C-f  Replaces the last result with a pretty printed version of it. f is for formatting.
;; ** --------------------------------------
#+end_src
** INI/dev/js-cfg.el
:PROPERTIES:
:header-args: :tangle INI/dev/js-cfg.el
:END:
*** описание

*** used in
;; (find-file "~/INI/dev-cfg.el")
(load (expand-file-name "INI/dev/js-cfg.el" user-emacs-directory))
