init.org
*** src
#+begin_src elisp
;; * EWW-MODE CUSTOMIZATION 
;; --------------------------------------
;; ** open-link-in-new-frame
;; --------------------------------------
(defun open-link-in-new-frame ()
  "open-link-in-new-frame"
  (interactive)
      (let (buffer-name-to-close (buffer-name))
        (evil-window-split)
        ;; (global-visual-line-mode)
        (eww-open-in-new-buffer)
        ;; (eww (shr-url-at-point nil))
        (evil-quit)
        (switch-to-buffer-other-frame buffer-name-to-close)))
;; --------------------------------------
;; ** eww-of
;; --------------------------------------
(defun eww-of (link)
  "open-eww-in-new-frame from link"
  (interactive)
      (let (buffer-name-to-close (buffer-name))
        (evil-window-split)
        ;; (global-visual-line-mode)
        (eww link)
        ;; (eww (shr-url-at-point nil))
        (evil-quit)
        (switch-to-buffer-other-frame buffer-name-to-close)))
;; --------------------------------------
;; ** org-open-link-in-new-frame
;; --------------------------------------
(defun org-open-link-in-new-frame ()
  " open org link in new frae end not folow
    org-open-link-in-new-frame"
  (interactive)
      (let (buffer-name-to-close (buffer-name))
        (evil-window-split)
        (org-open-at-point)
        ;; (eww (shr-url-at-point nil))
        (evil-quit)
        (switch-to-buffer-other-frame buffer-name-to-close)))
;; --------------------------------------
;; ** use-package
(use-package eww
  :defer t
  ;; :disabled
  :config
    ;; (setq pixel-wait 0.1)
    ;; (pixel-scroll-mode 1)
    ;; (setq scroll-preserve-screen-position 1)
    ;; (setq pixel-wait 0.10000000000000014)
;; ** external-browser : 
;; default value
;; (setq shr-external-browser 'browse-url-default-browser)
;; to set for special browse
;; (setq shr-external-browser 'browse-url-generic)
;; (setq browse-url-generic-program (executable-find "firefox"))
;; ** url-browser : 
;; (setq browse-url-browser-function
 ;; (setq browse-url-browser-function 'browse-url-generic
 ;;       browse-url-generic-program "qutebrowser")
(setq browse-url-handlers
      '((".*google.*maps.*" . browse-url-generic)
        ;; Github goes to firefox, but not gist
        ;; ("http.*\/\/github.com" . browse-url-generic)
        ("groups.google.com" . browse-url-generic)
        ("docs.google.com" . browse-url-generic)
        ;; ("melpa.org" . browse-url-generic)
        ("build.*\.elastic.co" . browse-url-generic)
        (".*-ci\.elastic.co" . browse-url-generic)
        ("gradle-enterprise.elastic.co" . browse-url-generic)
        ("internal-ci\.elastic\.co" . browse-url-generic)
        ("zendesk\.com" . browse-url-generic)
        ("salesforce\.com" . browse-url-generic)
        ;; ("stackoverflow\.com" . browse-url-generic)
        ("apache\.org\/jira" . browse-url-generic)
        ("thepoachedegg\.net" . browse-url-generic)
        ("zoom.us" . browse-url-generic)
        ("t.co" . browse-url-generic)
        ("twitter.com" . browse-url-generic)
        ("\/\/a.co" . browse-url-generic)
        ;; ("youtube.com" . browse-url-generic)
        ("amazon.com" . browse-url-generic)
        ("slideshare.net" . browse-url-generic)
        ("." . eww-browse-url)))

;; *** reader-browser : 
;; ** define-key : 
;; --------------------------------------
  :bind (:map  eww-mode-map
              ("C-<return>" . open-link-in-new-frame)
              ("o o" . eww)
              ("O O" . eww-browse-with-external-browser)
              ;; (\j . evil-scroll-line-down)
              ;; (\k . evil-scroll-line-up)
              ;; ("SPC" . buyn-reader-go)
              ;; ("SPC" . evil-scroll-down)
              ("SPC" . Info-scroll-up)
              ("Z F I" . (lambda() (interactive)
                            ((find-file-other-frame (expand-file-name "INI/www-cfg.el" user-emacs-directory)))))
              ;; ("S-SPC" . evil-scroll-up)
              ("S-SPC" . Info-scroll-down)
              ("<f8>" . read-aloud-buf)
              ("<f9>" . read-aloud-stop))

;; --------------------------------------
;; ** hooks : 
;; --------------------------------------
;; *** buyn-eww-hook : 
;; --------------------------------------
;; (defun buyn-eww-hook ()
;;    (global-visual-line-mode t))
;; (add-hook 'eww-mode-hook 'buyn-eww-hook)
;; *** eww-mode-hook : 
;; (add-hook 'eww-mode-hook #'toggle-word-wrap)
;; (add-hook 'eww-mode-hook #'buyn-reader-start)
;; --------------------------------------
;; ** the END) : 
  )
#+end_src
* **Мои Elisp скрипты**
** описание
   Персональные расширения и полезные функции.  
** list
  (find-file-other-frame (expand-file-name "ELs/BuYn/shell.el" user-emacs-directory))
  (find-file-other-frame (expand-file-name "ELs/BuYn/reader.el" user-emacs-directory))
  (find-file-other-frame "~/Dropbox/backup/file.el")
  ----- not auto loadet -----
  (find-file-other-frame "~/ELs/BuYn/ai-dungon.el")
  (find-file-other-frame "~/ELs/tts/tts-editor/tts-editor.el")
  (find-file-other-frame "~/ELs/BuYn/tts.el")
* **Архив и Deprecated конфиги**
** описание
    Всё, что уже не используется, но содержит полезные идеи.
** example
# :PROPERTIES:
# :header-args: :tangle INI/exempl.el
# :END:
*** описание

*** used in
;; (find-file "~/.archemacs/INI/init.el")
*** src
#+begin_src elisp

#+end_src
** elisp example
(load (expand-file-name "INI/interface/input-methods-cfg.el" user-emacs-directory))
** CANCELED команд 2 фрейме INI/evil_frame_cfg.el
CLOSED: [2025-02-25 Tue 01:20]
:PROPERTIES:
:header-args: :tangle no
:END:
# :header-args: :tangle INI/evil-frame-cfg.el
*** описание
Запуск команд в отдельнос фрейме
*** not used in
# ;; (find-file "~/.archemacs/INI/init.el")
*** src
#+begin_src elisp
;; --------------------- 
;; open comand on new frame 
;; --------------------- 
(defun run-command-in-new-frame (prefixarg command-name)
 (interactive (list current-prefix-arg (read-extended-command)))
 (let ((command (intern-soft command-name)))
   (unless command
    (error "%s is not a valid command name" command-name))
  (select-frame (make-frame))
  (let ((prefix-arg prefixarg))
    (command-execute command))))

(defun simple-run-command-in-new-frame (command)
  (select-frame (make-frame))
  (funcall command)
  (delete-other-windows))
;; --------------------- 
;; key for open comand on new frame 
;; --------------------- 
(define-key evil-normal-state-map "gtc" 'run-command-in-new-frame)
;; --------------------- 
;; key for open help on new frame 
;; --------------------- 
(define-key evil-normal-state-map "gthf" (lambda () (interactive) (simple-run-command-in-new-frame 'describe-function)))
(define-key evil-normal-state-map "gthk" (lambda () (interactive) (simple-run-command-in-new-frame 'describe-key)))
#+end_src
* блок для экспериментальных настроек
* Babel-блокам команд
* TODO орг файла
** add file to tagle evil-respect-input.el
(load (expand-file-name "ELs/Evil/evil-respect-input.el" user-emacs-directory))
** сделать теги и под разделы
*** обеснение
возность поиска как в вим
не только по контексту
но и тегам и сочетаниям тегов
тоесть обеденить тег бинды и ивил
и получить бинды ивала
а потом сделать поиск по разделам с такими тегами
*** биндс
*** ивил
** все бинды одного типа
(define-key org-mode-map (kbd "C-c <C-return>") 'org-table-insert-row)
** сделать блоки поиска
*** по тегам
*** по типам туду
получить список всех туду
*** возможно с учётом приоритетов
** ranger hydra menu
*** список папок куда открыть на ZR<space>
*** меню ганжера из ренжера
перейти в папку
набор действий
* start to use
** org-refile
*** link
(setq org-refile-targets '(("~/Dropbox/orgs/gtd/gtd.org" :maxlevel . 3)
*** review
некий инбокс с лёгкой класификацикй
** журнал для логирования
*** туду?
*** более одного журнал?
для логов туду машины
и отдельно имакса
журнал для каждого проекат
или всётаеи проще просто один орг лог фаил
* 2025-02-07

